#Использовать asserts
#Использовать "fixtures"
#Использовать ".."

#Область Тесты

&Тест
Процедура ТестДолжен_ПробрасыватьОшибкуЕслиОбработчикНеУстановлен() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Операция = Новый Действие(Сценарий, "ВсегдаОшибка");

	Стратегия = Новый СтратегияЗапасногоСценария();
	
	// Действие и Проверка
	Ожидаем
		.Что(Стратегия, "Вызов метода стратегии должен выбрасывать ожидаемое исключение")
		.Метод("Применить", ПомощникТестирования.ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Всегда ошибка.");

	Ожидаем.Что(Сценарий.СчетчикВызовов(), "Счетчик вызовов должен быть равен 1").Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВозвращатьРезультатДействияПриОшибке() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Операция = Новый Действие(Сценарий, "ВсегдаОшибка");

	Стратегия = Новый СтратегияЗапасногоСценария(Новый Действие(Сценарий, "УспехСКонтекстомОшибкиЗапасногоСценария"));
	
	// Действие
	Результат = Стратегия.Применить(Операция);

	// Проверка
	Ожидаем.Что(Результат, "Результат должен быть равен ожидаемому значению").Равно("ok");
	Ожидаем.Что(Сценарий.СчетчикВызовов(), "Счетчик вызовов должен быть равен 2").Равно(2);

КонецПроцедуры

&Тест
Процедура ТестДолжен_УстанавливатьОбработчик() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Операция = Новый Действие(Сценарий, "ВсегдаОшибка");

	Стратегия = Новый СтратегияЗапасногоСценария();
	Стратегия.УстановитьОбработчик(Новый Действие(Сценарий, "УспехСКонтекстомОшибкиЗапасногоСценария"));
	
	// Действие
	Результат = Стратегия.Применить(Операция);

	// Проверка
	Ожидаем.Что(Результат, "Результат должен быть равен ожидаемому значению").Равно("ok");
	Ожидаем.Что(Сценарий.СчетчикВызовов(), "Счетчик вызовов должен быть равен 2").Равно(2);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПоддерживатьЛямбдуВКонструктореДействияПриОшибке() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Операция = Новый Действие(Сценарий, "ВсегдаОшибка");

	Стратегия = Новый СтратегияЗапасногоСценария("Контекст -> ""lambda-запасной-сценарий""");
	
	// Действие
	Результат = Стратегия.Применить(Операция);

	// Проверка
	Ожидаем.Что(Результат, "Результат должен быть равен ожидаемому значению").Равно("lambda-запасной-сценарий");
	Ожидаем.Что(Сценарий.СчетчикВызовов(), "Счетчик вызовов должен быть равен 1").Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПередаватьДанныеОшибкиВКонтекстОшибкиЗапасногоСценария() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Операция = Новый Действие(Сценарий, "ВсегдаОшибка");

	Стратегия = Новый СтратегияЗапасногоСценария("Контекст -> КраткоеПредставлениеОшибки(Контекст.ДанныеОшибки())");
	
	// Действие
	Результат = Стратегия.Применить(Операция);

	// Проверка
	Ожидаем.Что(Результат, "Результат должен быть равен ожидаемому значению").Равно("Всегда ошибка.");
	Ожидаем.Что(Сценарий.СчетчикВызовов(), "Счетчик вызовов должен быть равен 1").Равно(1);

КонецПроцедуры

#КонецОбласти
