#Использовать asserts
#Использовать "fixtures"
#Использовать ".."

#Область Тесты

&Тест
Процедура ТестДолжен_ПодготавливатьСтроковуюЛямбдуКотораяВызываетПроцедуру() Экспорт

	// Подготовка
	Адаптер = Новый АдаптерОперацииОтказоустойчивости();
	ТестовыеОбработчики = Новый ТестовыеОбработчикиОтказоустойчивости();

	Параметры = Новый Массив();
	Параметры.Добавить(ТестовыеОбработчики);
	Параметры.Добавить("ctx");
	Параметры.Добавить("marker");

	Операция = Адаптер.Подготовить(
		"(Обработчики, Контекст, Маркер) -> Обработчики.ЗапомнитьВызов(Контекст, Маркер)",
		Параметры
	);

	// Действие
	Результат = Операция.Запустить();

	// Проверка
	Ожидаем.Что(Результат, "Процедурная лямбда не должна возвращать значение").Равно(Неопределено);
	Ожидаем.Что(ТестовыеОбработчики.Контексты().Количество(), "Количество вызовов должно быть равно 1").Равно(1);
	Ожидаем.Что(ТестовыеОбработчики.Маркеры().Количество(), "Количество маркеров должно быть равно 1").Равно(1);
	Ожидаем.Что(ТестовыеОбработчики.Контексты()[0], "Контекст должен быть равен ожидаемому значению").Равно("ctx");
	Ожидаем.Что(ТестовыеОбработчики.Маркеры()[0], "Маркер должен быть равен ожидаемому значению").Равно("marker");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапускатьДействиеПроцедуруСПараметрами() Экспорт

	// Подготовка
	ТестовыеОбработчики = Новый ТестовыеОбработчикиОтказоустойчивости();

	Параметры = Новый Массив();
	Параметры.Добавить("ctx");
	Параметры.Добавить("marker");

	Операция = Новый ПараметризованноеДействие(
		Новый Действие(ТестовыеОбработчики, "ЗапомнитьВызов"),
		Параметры
	);

	// Действие
	Результат = Операция.Запустить();

	// Проверка
	Ожидаем.Что(Результат, "Процедурное действие не должно возвращать значение").Равно(Неопределено);
	Ожидаем.Что(ТестовыеОбработчики.Контексты().Количество(), "Количество вызовов должно быть равно 1").Равно(1);
	Ожидаем.Что(ТестовыеОбработчики.Маркеры().Количество(), "Количество маркеров должно быть равно 1").Равно(1);
	Ожидаем.Что(ТестовыеОбработчики.Контексты()[0], "Контекст должен быть равен ожидаемому значению").Равно("ctx");
	Ожидаем.Что(ТестовыеОбработчики.Маркеры()[0], "Маркер должен быть равен ожидаемому значению").Равно("marker");

КонецПроцедуры

#КонецОбласти
