// BSLLS:LatinAndCyrillicSymbolInWord-off

#Использовать asserts
#Использовать "fixtures"
#Использовать ".."

#Область Тесты

&Тест
Процедура ТестДолжен_ОграничиватьВызовыПоRateLimit() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Стратегия = Новый СтратегияRateLimit(2, 200);
	Операция = Новый Действие(Сценарий, "Успех");

	// Действие и Проверка
	Ожидаем.Что(Стратегия.Применить(Операция)).Равно("ok");
	Ожидаем.Что(Стратегия.Применить(Операция)).Равно("ok");

	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("RateLimit");

	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(2);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СбрасыватьRateLimitПослеПериода() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Стратегия = Новый СтратегияRateLimit(1, 120);
	Операция = Новый Действие(Сценарий, "Успех");

	// Действие и Проверка
	Ожидаем.Что(Стратегия.Применить(Операция)).Равно("ok");
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("RateLimit");

	Приостановить(140);

	Ожидаем.Что(Стратегия.Применить(Операция)).Равно("ok");
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(2);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПрименятьУстановленныеЛимитВызововИИнтервалЛимита() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();

	Стратегия = Новый СтратегияRateLimit(10, 1000)
		.УстановитьЛимитВызовов(1)
		.УстановитьИнтервалЛимита(120);

	Операция = Новый Действие(Сценарий, "Успех");

	// Действие и Проверка
	Ожидаем.Что(Стратегия.Применить(Операция)).Равно("ok");

	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("RateLimit");

	Ожидаем.Что(Стратегия.ЛимитВызовов()).Равно(1);
	Ожидаем.Что(Стратегия.ИнтервалЛимита()).Равно(120);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВызыватьОбработчикПревышенияЛимитаПередИсключением() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	КолбэкиRateLimit = Новый ТестовыеКолбэкиRateLimit();

	Стратегия = Новый СтратегияRateLimit(1, 200);
	Стратегия.УстановитьОбработчикПревышенияЛимита(Новый Действие(КолбэкиRateLimit, "ПослеПревышенияЛимита"));

	Операция = Новый Действие(Сценарий, "Успех");

	// Действие и Проверка
	Ожидаем.Что(Стратегия.Применить(Операция)).Равно("ok");

	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("RateLimit");

	Ожидаем.Что(КолбэкиRateLimit.ОставшеесяВремя()).ИмеетДлину(1);
	Ожидаем.Что(КолбэкиRateLimit.ЛимитыВызовов()[0]).Равно(1);
	Ожидаем.Что(КолбэкиRateLimit.ИнтервалыЛимита()[0]).Равно(200);
	Ожидаем.Что(КолбэкиRateLimit.КоличествоВызововЗаИнтервал()[0]).Равно(1);
	Ожидаем.Что(КолбэкиRateLimit.ОставшеесяВремя()[0]).БольшеИлиРавно(0);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыИсполнения(Операция, ПараметрыОперации = Неопределено)

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Операция);
	Если ПараметрыОперации <> Неопределено Тогда
		ПараметрыМетода.Добавить(ПараметрыОперации);
	КонецЕсли;

	Возврат ПараметрыМетода;

КонецФункции

#КонецОбласти
