// BSLLS:LatinAndCyrillicSymbolInWord-off

#Использовать asserts
#Использовать "fixtures"
#Использовать ".."

#Область Тесты

&Тест
Процедура ТестДолжен_ПовторятьОперациюДоУспеха() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(2);

	Стратегия = Новый СтратегияRetry(3);
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие
	Результат = Стратегия.Применить(Операция);

	// Проверка
	Ожидаем.Что(Результат).Равно("ok");
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(3);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПоддерживатьДействиеКакОперацию() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(1);

	Стратегия = Новый СтратегияRetry(1, 0);
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие
	Стратегия.Применить(Операция);

	// Проверка
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(2);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПередаватьПараметрыВДействиеОперации() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Стратегия = Новый СтратегияRetry(0, 0);
	Операция = Новый Действие(Сценарий, "УспехСПараметрами");
	ПараметрыОперации = Новый Массив();
	ПараметрыОперации.Добавить("left");
	ПараметрыОперации.Добавить("right");

	// Действие
	Результат = Стратегия.Применить(Операция, ПараметрыОперации);

	// Проверка
	Ожидаем.Что(Результат).Равно("left:right");
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОстановитьПовторПослеИсчерпанияПопыток() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);

	Стратегия = Новый СтратегияRetry(2);
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие и Проверка
	Ожидаем.Что(Стратегия).Метод("Применить", ПараметрыИсполнения(Операция)).ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(3);

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеПовторятьЕслиУсловиеПовтораНеРазрешаетПовтор() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);

	Стратегия = Новый СтратегияRetry()
		.УстановитьМаксимумПовторов(3)
		.УстановитьЗадержку(0)
		.УстановитьУсловиеПовтора("КонтекстПовтора -> Ложь");

	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке 1");

	// Проверка
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПовторятьПоНеудачномуРезультату() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьКоличествоНеудачныхРезультатовДоУспеха(2);
	Сценарий.УстановитьНеудачныйРезультат("fail");
	Сценарий.УстановитьРезультат("ok");

	Стратегия = Новый СтратегияRetry()
		.УстановитьМаксимумПовторов(3)
		.УстановитьЗадержку(0)
		.УстановитьУсловиеПовтора("КонтекстПовтора -> КонтекстПовтора.Результат() = ""fail""");

	Операция = Новый Действие(Сценарий, "НестабильныйРезультат");

	// Действие
	Результат = Стратегия.Применить(Операция);

	// Проверка
	Ожидаем.Что(Результат).Равно("ok");
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(3);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СтроитьЛинейнуюЗадержкуИВызыватьОбработчикПовтора() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);

	КолбэкиRetry = Новый ТестовыеКолбэкиRetry();

	Стратегия = Новый СтратегияRetry()
		.УстановитьМаксимумПовторов(3)
		.УстановитьЗадержку(2)
		.УстановитьТипЗадержки(ТипыРасчетаЗадержки.Линейная)
		.УстановитьОбработчикПовтора(Новый Действие(КолбэкиRetry, "ПослеПовтора"));

	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	Задержки = КолбэкиRetry.Задержки();
	НомераПопыток = КолбэкиRetry.НомераПопыток();

	Ожидаем.Что(Задержки).ИмеетДлину(3);
	Ожидаем.Что(Задержки[0]).Равно(2);
	Ожидаем.Что(Задержки[1]).Равно(4);
	Ожидаем.Что(Задержки[2]).Равно(6);
	Ожидаем.Что(НомераПопыток[0]).Равно(0);
	Ожидаем.Что(НомераПопыток[1]).Равно(1);
	Ожидаем.Что(НомераПопыток[2]).Равно(2);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИспользоватьВычислениеЗадержкиВместоВстроенногоРасчета() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);

	КолбэкиRetry = Новый ТестовыеКолбэкиRetry();

	Стратегия = Новый СтратегияRetry()
		.УстановитьМаксимумПовторов(1)
		.УстановитьЗадержку(50)
		.УстановитьВычислениеЗадержки("Контекст -> 7")
		.УстановитьОбработчикПовтора(Новый Действие(КолбэкиRetry, "ПослеПовтора"));

	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	Задержки = КолбэкиRetry.Задержки();
	
	Ожидаем.Что(Задержки.Количество()).Равно(1);
	Ожидаем.Что(Задержки[0]).Равно(7);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПередаватьДлительностьВыполненияОперацииВКонтекстПовтора() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);
	Сценарий.УстановитьЗадержку(100);

	КолбэкиRetry = Новый ТестовыеКолбэкиRetry();

	Стратегия = Новый СтратегияRetry()
		.УстановитьМаксимумПовторов(1)
		.УстановитьЗадержку(0)
		.УстановитьОбработчикПовтора(Новый Действие(КолбэкиRetry, "ПослеПовтора"));
	
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	ДлительностиВыполнения = КолбэкиRetry.ДлительностиВыполнения();

	Ожидаем.Что(ДлительностиВыполнения.Количество()).Равно(1);
	Ожидаем.Что(ДлительностиВыполнения[0]).БольшеИлиРавно(100);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПередаватьСледующуюПопыткуИОставшиесяПопыткиВКонтекстПовтора() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);

	КолбэкиRetry = Новый ТестовыеКолбэкиRetry();

	Стратегия = Новый СтратегияRetry();
	Стратегия.УстановитьМаксимумПовторов(2);
	Стратегия.УстановитьЗадержку(0);
	Стратегия.УстановитьОбработчикПовтора(Новый Действие(КолбэкиRetry, "ПослеПовтора"));
	
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	СледующиеПопытки = КолбэкиRetry.СледующиеПопытки();
	ПопытокОсталось = КолбэкиRetry.ПопытокОсталось();

	Ожидаем.Что(СледующиеПопытки.Количество()).Равно(2);
	Ожидаем.Что(ПопытокОсталось.Количество()).Равно(2);
	Ожидаем.Что(СледующиеПопытки[0]).Равно(1);
	Ожидаем.Что(СледующиеПопытки[1]).Равно(2);
	Ожидаем.Что(ПопытокОсталось[0]).Равно(2);
	Ожидаем.Что(ПопытокОсталось[1]).Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОграничиватьЗадержкуМаксимальнымЗначением() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);

	КолбэкиRetry = Новый ТестовыеКолбэкиRetry();

	Стратегия = Новый СтратегияRetry();
	Стратегия.УстановитьМаксимумПовторов(2);
	Стратегия.УстановитьЗадержку(10);
	Стратегия.УстановитьТипЗадержки(ТипыРасчетаЗадержки.Экспоненциальная);
	Стратегия.УстановитьМаксимальнуюЗадержку(15);
	Стратегия.УстановитьОбработчикПовтора(Новый Действие(КолбэкиRetry, "ПослеПовтора"));
	
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	Задержки = КолбэкиRetry.Задержки();

	Ожидаем.Что(Задержки.Количество()).Равно(2);
	Ожидаем.Что(Задержки[0]).Равно(10);
	Ожидаем.Что(Задержки[1]).Равно(15);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОтключатьОграничениеМаксимальнойЗадержкиПриНуле() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);

	КолбэкиRetry = Новый ТестовыеКолбэкиRetry();

	Стратегия = Новый СтратегияRetry();
	Стратегия.УстановитьМаксимумПовторов(2);
	Стратегия.УстановитьЗадержку(10);
	Стратегия.УстановитьТипЗадержки(ТипыРасчетаЗадержки.Экспоненциальная);
	Стратегия.УстановитьМаксимальнуюЗадержку(0);
	Стратегия.УстановитьОбработчикПовтора(Новый Действие(КолбэкиRetry, "ПослеПовтора"));
	
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	Задержки = КолбэкиRetry.Задержки();

	Ожидаем.Что(Задержки.Количество()).Равно(2);
	Ожидаем.Что(Задержки[0]).Равно(10);
	Ожидаем.Что(Задержки[1]).Равно(20);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПоддерживатьЛямбдуДляОбработчикаПовтора() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);

	Стратегия = Новый СтратегияRetry();
	Стратегия.УстановитьМаксимумПовторов(1);
	Стратегия.УстановитьЗадержку(0);
	Стратегия.УстановитьОбработчикПовтора("(КонтекстПовтора) -> ВызватьИсключение ""Обработчик повтора вызван""");
	
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Обработчик повтора вызван");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавлятьСлучайныйРазбросКЗадержке() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);

	КолбэкиRetry = Новый ТестовыеКолбэкиRetry();

	Стратегия = Новый СтратегияRetry();
	Стратегия.УстановитьМаксимумПовторов(1);
	Стратегия.УстановитьЗадержку(100);
	Стратегия.ИспользоватьРазбросЗадержки();
	Стратегия.УстановитьОбработчикПовтора(Новый Действие(КолбэкиRetry, "ПослеПовтора"));
	
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	Задержки = КолбэкиRetry.Задержки();

	Ожидаем.Что(Задержки.Количество()).Равно(1);
	Ожидаем.Что(Задержки[0]).БольшеИлиРавно(75);
	Ожидаем.Что(Задержки[0]).МеньшеИлиРавно(125);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыИсполнения(Операция, ПараметрыОперации = Неопределено)

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Операция);
	Если ПараметрыОперации <> Неопределено Тогда
		ПараметрыМетода.Добавить(ПараметрыОперации);
	КонецЕсли;

	Возврат ПараметрыМетода;

КонецФункции

#КонецОбласти
