#Использовать asserts
#Использовать "fixtures"
#Использовать ".."

#Область Тесты

&Тест
Процедура ТестДолжен_ПовторятьОперациюДоУспеха() Экспорт

	// Подготовка
	Стратегия = Новый СтратегияПовтора(3);

	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(2);
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие
	Результат = Стратегия.Применить(Операция);

	// Проверка
	Ожидаем.Что(Результат).Равно("ok");
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(3);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПоддерживатьДействиеКакОперацию() Экспорт

	// Подготовка
	Стратегия = Новый СтратегияПовтора(1, 0);

	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(1);
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие
	Стратегия.Применить(Операция);

	// Проверка
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(2);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПередаватьПараметрыВДействиеОперации() Экспорт

	// Подготовка
	Стратегия = Новый СтратегияПовтора(0, 0);
	
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Операция = Новый Действие(Сценарий, "УспехСПараметрами");

	ПараметрыОперации = Новый Массив();
	ПараметрыОперации.Добавить("left");
	ПараметрыОперации.Добавить("right");

	// Действие
	Результат = Стратегия.Применить(Операция, ПараметрыОперации);

	// Проверка
	Ожидаем.Что(Результат).Равно("left:right");
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОстановитьПовторПослеИсчерпанияПопыток() Экспорт

	// Подготовка
	Стратегия = Новый СтратегияПовтора(2);

	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПомощникТестирования.ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(3);

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеПовторятьЕслиУсловиеПовтораНеРазрешаетПовтор() Экспорт

	// Подготовка
	Стратегия = Новый СтратегияПовтора()
		.УстановитьМаксимумПовторов(3)
		.УстановитьЗадержку(0)
		.УстановитьУсловиеПовтора("Контекст -> Ложь");

	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПомощникТестирования.ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке 1");

	// Проверка
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПовторятьПоНеудачномуРезультату() Экспорт

	// Подготовка
	Стратегия = Новый СтратегияПовтора()
		.УстановитьМаксимумПовторов(3)
		.УстановитьЗадержку(0)
		.УстановитьУсловиеПовтора("КонтекстПовтора -> КонтекстПовтора.Результат() = ""fail""");

	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьКоличествоНеудачныхРезультатовДоУспеха(2);
	Сценарий.УстановитьНеудачныйРезультат("fail");
	Сценарий.УстановитьРезультат("ok");

	Операция = Новый Действие(Сценарий, "НестабильныйРезультат");

	// Действие
	Результат = Стратегия.Применить(Операция);

	// Проверка
	Ожидаем.Что(Результат).Равно("ok");
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(3);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СтроитьЛинейнуюЗадержкуИВызыватьОбработчикПовтора() Экспорт

	// Подготовка
	Колбэки = Новый ТестовыеКолбэкиПовтора();

	Стратегия = Новый СтратегияПовтора()
		.УстановитьМаксимумПовторов(3)
		.УстановитьЗадержку(2)
		.УстановитьТипЗадержки(ТипыРасчетаЗадержки.Линейная)
		.УстановитьОбработчикПовтора(Новый Действие(Колбэки, "ПослеПовтора"));

	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПомощникТестирования.ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	Задержки = Колбэки.Задержки();
	НомераПопыток = Колбэки.НомераПопыток();

	Ожидаем.Что(Задержки).ИмеетДлину(3);
	Ожидаем.Что(Задержки[0]).Равно(2);
	Ожидаем.Что(Задержки[1]).Равно(4);
	Ожидаем.Что(Задержки[2]).Равно(6);
	Ожидаем.Что(НомераПопыток[0]).Равно(0);
	Ожидаем.Что(НомераПопыток[1]).Равно(1);
	Ожидаем.Что(НомераПопыток[2]).Равно(2);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИспользоватьВычислениеЗадержкиВместоВстроенногоРасчета() Экспорт

	// Подготовка
	Колбэки = Новый ТестовыеКолбэкиПовтора();

	Стратегия = Новый СтратегияПовтора()
		.УстановитьМаксимумПовторов(1)
		.УстановитьЗадержку(50)
		.УстановитьВычислениеЗадержки("(Контекст) -> 7")
		.УстановитьОбработчикПовтора(Новый Действие(Колбэки, "ПослеПовтора"));

	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПомощникТестирования.ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	Задержки = Колбэки.Задержки();
	
	Ожидаем.Что(Задержки.Количество()).Равно(1);
	Ожидаем.Что(Задержки[0]).Равно(7);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПередаватьДлительностьВыполненияОперацииВКонтекстПовтора() Экспорт

	// Подготовка
	Колбэки = Новый ТестовыеКолбэкиПовтора();

	Стратегия = Новый СтратегияПовтора()
		.УстановитьМаксимумПовторов(1)
		.УстановитьЗадержку(0)
		.УстановитьОбработчикПовтора(Новый Действие(Колбэки, "ПослеПовтора"));
	
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);
	Сценарий.УстановитьЗадержку(100);
	
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПомощникТестирования.ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	ДлительностиВыполнения = Колбэки.ДлительностиВыполнения();

	Ожидаем.Что(ДлительностиВыполнения.Количество()).Равно(1);
	Ожидаем.Что(ДлительностиВыполнения[0]).БольшеИлиРавно(100);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПередаватьСледующуюПопыткуИОставшиесяПопыткиВКонтекстПовтора() Экспорт

	// Подготовка
	Колбэки = Новый ТестовыеКолбэкиПовтора();

	Стратегия = Новый СтратегияПовтора()
		.УстановитьМаксимумПовторов(2)
		.УстановитьЗадержку(0)
		.УстановитьОбработчикПовтора(Новый Действие(Колбэки, "ПослеПовтора"));

	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);	
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПомощникТестирования.ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	СледующиеПопытки = Колбэки.СледующиеПопытки();
	ПопытокОсталось = Колбэки.ПопытокОсталось();

	Ожидаем.Что(СледующиеПопытки.Количество()).Равно(2);
	Ожидаем.Что(ПопытокОсталось.Количество()).Равно(2);
	Ожидаем.Что(СледующиеПопытки[0]).Равно(1);
	Ожидаем.Что(СледующиеПопытки[1]).Равно(2);
	Ожидаем.Что(ПопытокОсталось[0]).Равно(2);
	Ожидаем.Что(ПопытокОсталось[1]).Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОграничиватьЗадержкуМаксимальнымЗначением() Экспорт

	// Подготовка
	Колбэки = Новый ТестовыеКолбэкиПовтора();

	Стратегия = Новый СтратегияПовтора()
		.УстановитьМаксимумПовторов(2)
		.УстановитьЗадержку(10)
		.УстановитьТипЗадержки(ТипыРасчетаЗадержки.Экспоненциальная)
		.УстановитьМаксимальнуюЗадержку(15)
		.УстановитьОбработчикПовтора(Новый Действие(Колбэки, "ПослеПовтора"));
		
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПомощникТестирования.ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	Задержки = Колбэки.Задержки();

	Ожидаем.Что(Задержки.Количество()).Равно(2);
	Ожидаем.Что(Задержки[0]).Равно(10);
	Ожидаем.Что(Задержки[1]).Равно(15);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОтключатьОграничениеМаксимальнойЗадержкиПриНуле() Экспорт

	// Подготовка
	Колбэки = Новый ТестовыеКолбэкиПовтора();

	Стратегия = Новый СтратегияПовтора()
		.УстановитьМаксимумПовторов(2)
		.УстановитьЗадержку(10)
		.УстановитьТипЗадержки(ТипыРасчетаЗадержки.Экспоненциальная)
		.УстановитьМаксимальнуюЗадержку(0)
		.УстановитьОбработчикПовтора(Новый Действие(Колбэки, "ПослеПовтора"));
	
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПомощникТестирования.ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	Задержки = Колбэки.Задержки();

	Ожидаем.Что(Задержки.Количество()).Равно(2);
	Ожидаем.Что(Задержки[0]).Равно(10);
	Ожидаем.Что(Задержки[1]).Равно(20);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПоддерживатьЛямбдуДляОбработчикаПовтора() Экспорт

	// Подготовка
	Стратегия = Новый СтратегияПовтора()
		.УстановитьМаксимумПовторов(1)
		.УстановитьЗадержку(0)
		.УстановитьОбработчикПовтора("(КонтекстПовтора) -> ВызватьИсключение ""Обработчик повтора вызван""");
	
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПомощникТестирования.ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Обработчик повтора вызван");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавлятьСлучайныйРазбросКЗадержке() Экспорт

	// Подготовка
	Колбэки = Новый ТестовыеКолбэкиПовтора();

	Стратегия = Новый СтратегияПовтора()
		.УстановитьМаксимумПовторов(1)
		.УстановитьЗадержку(100)
		.ИспользоватьРазбросЗадержки()
		.УстановитьОбработчикПовтора(Новый Действие(Колбэки, "ПослеПовтора"));
	
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьОшибокДоУспеха(10);
	Операция = Новый Действие(Сценарий, "Нестабильное");

	// Действие
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПомощникТестирования.ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Ошибка на попытке");

	// Проверка
	Задержки = Колбэки.Задержки();

	Ожидаем.Что(Задержки.Количество()).Равно(1);
	Ожидаем.Что(Задержки[0]).БольшеИлиРавно(75);
	Ожидаем.Что(Задержки[0]).МеньшеИлиРавно(125);

КонецПроцедуры

#КонецОбласти