// BSLLS:LatinAndCyrillicSymbolInWord-off

#Использовать asserts
#Использовать "fixtures"
#Использовать ".."

#Область Тесты

&Тест
Процедура ТестДолжен_СрабатыватьПоТаймауту() Экспорт

	// Подготовка
	Стратегия = Новый СтратегияТаймаута(20);
	
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьЗадержку(300);
	Операция = Новый Действие(Сценарий, "Долгое");

	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();

	// Действие
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПомощникТестирования.ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("таймаут");

	// Проверка
	Прошло = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала;
	Ожидаем.Что(Прошло).Меньше(200);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПрименятьУстановленныйТаймаут() Экспорт

	// Подготовка
	Стратегия = Новый СтратегияТаймаута(200);
	Стратегия.УстановитьТаймаут(20);

	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьЗадержку(80);
	
	Операция = Новый Действие(Сценарий, "Долгое");

	// Действие
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПомощникТестирования.ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("таймаут");

	// Проверка
	Ожидаем.Что(Стратегия.Таймаут()).Равно(20);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПробрасыватьОшибкуОперацииДоТаймаута() Экспорт

	// Подготовка
	Стратегия = Новый СтратегияТаймаута(200);

	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Операция = Новый Действие(Сценарий, "ВсегдаОшибка");

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПомощникТестирования.ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Всегда ошибка");

КонецПроцедуры

#КонецОбласти