#Использовать asserts
#Использовать ".."

#Область Тесты

&Тест
Процедура ТестДолжен_ПредоставлятьКодыПредметныхОшибок() Экспорт

	// Действие и Проверка
	Ожидаем
		.Что(КодыОшибокОтказоустойчивости.ПревышениеТаймаута())
		.Равно("resilience.timeout.exceeded");
	Ожидаем
		.Что(КодыОшибокОтказоустойчивости.ОтклонениеПоОграничениюВызовов())
		.Равно("resilience.rate_limit.rejected");
	Ожидаем
		.Что(КодыОшибокОтказоустойчивости.ОтклонениеПоОграничениюПараллелизма())
		.Равно("resilience.parallelism.rejected");
	Ожидаем
		.Что(КодыОшибокОтказоустойчивости.ПревышениеОжиданияСлотаПараллелизма())
		.Равно("resilience.parallelism.wait_timeout");
	Ожидаем
		.Что(КодыОшибокОтказоустойчивости.ОсвобождениеНезанятогоСлота())
		.Равно("resilience.parallelism.slot_not_acquired");
	Ожидаем
		.Что(КодыОшибокОтказоустойчивости.ОтклонениеИзмененияОграниченийПараллелизма())
		.Равно("resilience.parallelism.configuration_change_rejected");
	Ожидаем
		.Что(КодыОшибокОтказоустойчивости.РазомкнутыйПредохранитель())
		.Равно("resilience.circuit.open");
	Ожидаем
		.Что(КодыОшибокОтказоустойчивости.ОтменаОперации())
		.Равно("resilience.operation.cancelled");

КонецПроцедуры

#КонецОбласти
