// BSLLS:LatinAndCyrillicSymbolInWord-off

#Использовать asserts
#Использовать "fixtures"
#Использовать ".."

#Область Тесты

&Тест
Процедура ТестДолжен_ПробрасыватьОшибкуЕслиОбработчикНеУстановлен() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Стратегия = Новый СтратегияFallback();
	Операция = Новый Действие(Сценарий, "ВсегдаОшибка");

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Всегда ошибка.");

	// Проверка
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВозвращатьРезультатДействияПриОшибке() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Стратегия = Новый СтратегияFallback(Новый Действие(Сценарий, "УспехСКонтекстомОшибкиFallback"));
	Операция = Новый Действие(Сценарий, "ВсегдаОшибка");

	// Действие
	Результат = Стратегия.Применить(Операция);

	// Проверка
	Ожидаем.Что(Результат).Равно("ok");
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(2);

КонецПроцедуры

&Тест
Процедура ТестДолжен_УстанавливатьОбработчик() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Стратегия = Новый СтратегияFallback();
	Стратегия.УстановитьОбработчик(Новый Действие(Сценарий, "УспехСКонтекстомОшибкиFallback"));
	Операция = Новый Действие(Сценарий, "ВсегдаОшибка");

	// Действие
	Результат = Стратегия.Применить(Операция);

	// Проверка
	Ожидаем.Что(Результат).Равно("ok");
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(2);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПоддерживатьЛямбдуВКонструктореДействияПриОшибке() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Стратегия = Новый СтратегияFallback("Контекст -> ""lambda-fallback""");
	Операция = Новый Действие(Сценарий, "ВсегдаОшибка");

	// Действие
	Результат = Стратегия.Применить(Операция);

	// Проверка
	Ожидаем.Что(Результат).Равно("lambda-fallback");
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПередаватьДанныеОшибкиВКонтекстFallback() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Стратегия = Новый СтратегияFallback("Контекст -> КраткоеПредставлениеОшибки(Контекст.ДанныеОшибки())");
	Операция = Новый Действие(Сценарий, "ВсегдаОшибка");

	// Действие
	Результат = Стратегия.Применить(Операция);

	// Проверка
	Ожидаем.Что(Результат).Равно("Всегда ошибка.");
	Ожидаем.Что(Сценарий.СчетчикВызовов()).Равно(1);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыИсполнения(Операция, ПараметрыОперации = Неопределено)

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Операция);
	Если ПараметрыОперации <> Неопределено Тогда
		ПараметрыМетода.Добавить(ПараметрыОперации);
	КонецЕсли;

	Возврат ПараметрыМетода;

КонецФункции

#КонецОбласти
