// BSLLS:LatinAndCyrillicSymbolInWord-off

#Использовать asserts
#Использовать "fixtures"
#Использовать ".."

#Область Тесты

&Тест
Процедура ТестДолжен_СрабатыватьПоТаймауту() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьЗадержку(300);

	Стратегия = Новый СтратегияTimeout(20);
	Операция = Новый Действие(Сценарий, "Долгое");
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("таймаут");

	// Проверка
	Прошло = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала;
	Ожидаем.Что(Прошло).Меньше(200);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПрименятьУстановленныйТаймаут() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Сценарий.УстановитьЗадержку(80);

	Стратегия = Новый СтратегияTimeout(200);
	Стратегия.УстановитьТаймаут(20);
	
	Операция = Новый Действие(Сценарий, "Долгое");

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("таймаут");

	// Проверка
	Ожидаем.Что(Стратегия.Таймаут()).Равно(20);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПробрасыватьОшибкуОперацииДоТаймаута() Экспорт

	// Подготовка
	Сценарий = Новый ТестовыеДействияОтказоустойчивости();
	Стратегия = Новый СтратегияTimeout(200);
	Операция = Новый Действие(Сценарий, "ВсегдаОшибка");

	// Действие и Проверка
	Ожидаем
		.Что(Стратегия)
		.Метод("Применить", ПараметрыИсполнения(Операция))
		.ВыбрасываетИсключение("Всегда ошибка");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыИсполнения(Операция, ПараметрыОперации = Неопределено)

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Операция);
	Если ПараметрыОперации <> Неопределено Тогда
		ПараметрыМетода.Добавить(ПараметрыОперации);
	КонецЕсли;

	Возврат ПараметрыМетода;

КонецФункции

#КонецОбласти
