Перем _ОставшеесяВремя; // Массив
Перем _ЛимитыВызовов; // Массив
Перем _ИнтервалыЛимита; // Массив
Перем _КоличествоВызововЗаИнтервал; // Массив
Перем _Маркеры; // Массив

Процедура ПриСозданииОбъекта()
	_ОставшеесяВремя = Новый Массив();
	_ЛимитыВызовов = Новый Массив();
	_ИнтервалыЛимита = Новый Массив();
	_КоличествоВызововЗаИнтервал = Новый Массив();
	_Маркеры = Новый Массив();
КонецПроцедуры

Процедура ПослеПревышенияЛимита(КонтекстПревышенияЛимита) Экспорт

	_ОставшеесяВремя.Добавить(КонтекстПревышенияЛимита.ОсталосьОжидать());
	_ЛимитыВызовов.Добавить(КонтекстПревышенияЛимита.ЛимитВызовов());
	_ИнтервалыЛимита.Добавить(КонтекстПревышенияЛимита.ИнтервалЛимита());
	_КоличествоВызововЗаИнтервал.Добавить(КонтекстПревышенияЛимита.КоличествоВызововЗаИнтервал());

КонецПроцедуры

Процедура ПослеПревышенияЛимитаСМаркером(КонтекстПревышенияЛимита, Маркер) Экспорт

	ПослеПревышенияЛимита(КонтекстПревышенияЛимита);
	_Маркеры.Добавить(Маркер);

КонецПроцедуры

Функция ОставшеесяВремя() Экспорт
	Возврат _ОставшеесяВремя;
КонецФункции

Функция ЛимитыВызовов() Экспорт
	Возврат _ЛимитыВызовов;
КонецФункции

Функция ИнтервалыЛимита() Экспорт
	Возврат _ИнтервалыЛимита;
КонецФункции

Функция КоличествоВызововЗаИнтервал() Экспорт
	Возврат _КоличествоВызововЗаИнтервал;
КонецФункции

Функция Маркеры() Экспорт
	Возврат _Маркеры;
КонецФункции
