Перем _НеудачныйРезультат; // Произвольный
Перем _ВозвращаемаяЗадержка; // Число, Неопределено
Перем _Задержки; // Массив
Перем _ДлительностиВыполнения; // Массив
Перем _НомераПопыток; // Массив
Перем _СледующиеПопытки; // Массив
Перем _ПопытокОсталось; // Массив
Перем _Маркеры; // Массив

Процедура ПриСозданииОбъекта()
	_НеудачныйРезультат = Неопределено;
	_ВозвращаемаяЗадержка = Неопределено;
	_Задержки = Новый Массив();
	_ДлительностиВыполнения = Новый Массив();
	_НомераПопыток = Новый Массив();
	_СледующиеПопытки = Новый Массив();
	_ПопытокОсталось = Новый Массив();
	_Маркеры = Новый Массив();
КонецПроцедуры

Процедура ПослеПовтораСМаркером(КонтекстПовтора, Маркер) Экспорт

	ПослеПовтора(КонтекстПовтора);
	_Маркеры.Добавить(Маркер);

КонецПроцедуры

Функция УстановитьНеудачныйРезультат(НеудачныйРезультат) Экспорт
	_НеудачныйРезультат = НеудачныйРезультат;
	Возврат ЭтотОбъект;
КонецФункции

Функция УстановитьВозвращаемуюЗадержку(ВозвращаемаяЗадержка) Экспорт
	_ВозвращаемаяЗадержка = ВозвращаемаяЗадержка;
	Возврат ЭтотОбъект;
КонецФункции

Функция НеПовторять(КонтекстПовтора) Экспорт
	Возврат Ложь;
КонецФункции

Функция ПовторятьПоНеудачномуРезультату(КонтекстПовтора) Экспорт
	Если КонтекстПовтора.ЕстьИсключение() Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат КонтекстПовтора.Результат() = _НеудачныйРезультат;
КонецФункции

Функция ГенерироватьЗадержку(КонтекстПовтора) Экспорт
	Возврат _ВозвращаемаяЗадержка;
КонецФункции

Процедура ПослеПовтора(КонтекстПовтора) Экспорт

	_НомераПопыток.Добавить(КонтекстПовтора.НомерПопытки());
	_СледующиеПопытки.Добавить(КонтекстПовтора.СледующаяПопытка());
	_ПопытокОсталось.Добавить(КонтекстПовтора.ПопытокОсталось());
	_Задержки.Добавить(КонтекстПовтора.Задержка());
	_ДлительностиВыполнения.Добавить(КонтекстПовтора.ДлительностьВыполнения());

КонецПроцедуры

Функция Задержки() Экспорт
	Возврат _Задержки;
КонецФункции

Функция ДлительностиВыполнения() Экспорт
	Возврат _ДлительностиВыполнения;
КонецФункции

Функция НомераПопыток() Экспорт
	Возврат _НомераПопыток;
КонецФункции

Функция СледующиеПопытки() Экспорт
	Возврат _СледующиеПопытки;
КонецФункции

Функция ПопытокОсталось() Экспорт
	Возврат _ПопытокОсталось;
КонецФункции

Функция Маркеры() Экспорт
	Возврат _Маркеры;
КонецФункции
