Перем _Контексты; // Массив
Перем _Маркеры; // Массив

Процедура ПриСозданииОбъекта()

	_Контексты = Новый Массив();
	_Маркеры = Новый Массив();

КонецПроцедуры

Функция СформироватьРезультат(Контекст, Маркер, Число) Экспорт
	Возврат СтрШаблон("%1|%2|%3", Контекст, Маркер, Число);
КонецФункции

Процедура ЗапомнитьВызов(Контекст, Маркер) Экспорт

	_Контексты.Добавить(Контекст);
	_Маркеры.Добавить(Маркер);

КонецПроцедуры

Функция Контексты() Экспорт
	Возврат _Контексты;
КонецФункции

Функция Маркеры() Экспорт
	Возврат _Маркеры;
КонецФункции
