Перем _Стратегия; // СтратегияОграниченияПараллелизма
Перем _ВложеннаяОперация; // Действие
Перем _ТекстВнутреннейОшибки; // Строка, Неопределено
Перем _ИнформацияОВнутреннейОшибке; // ИнформацияОбОшибке, Неопределено

Процедура ПриСозданииОбъекта(Стратегия, ВложеннаяОперация)

	_Стратегия = Стратегия;
	_ВложеннаяОперация = ВложеннаяОперация;
	_ТекстВнутреннейОшибки = Неопределено;
	_ИнформацияОВнутреннейОшибке = Неопределено;

КонецПроцедуры

Функция ВыполнитьСВложеннымЗапуском() Экспорт

	Попытка
		_Стратегия.Применить(_ВложеннаяОперация);
	Исключение
		_ТекстВнутреннейОшибки = ОписаниеОшибки();
		_ИнформацияОВнутреннейОшибке = ИнформацияОбОшибке();
	КонецПопытки;

	Возврат "ok";

КонецФункции

Функция ТекстВнутреннейОшибки() Экспорт
	Возврат _ТекстВнутреннейОшибки;
КонецФункции

Функция ИнформацияОВнутреннейОшибке() Экспорт
	Возврат _ИнформацияОВнутреннейОшибке;
КонецФункции
