Перем _Префикс; // Строка
Перем _СчетчикПрименений; // Число

Процедура ПриСозданииОбъекта(Префикс = "пользовательская:")

	_Префикс = Префикс;
	_СчетчикПрименений = 0;

КонецПроцедуры

Функция Применить(Операция, Параметры = Неопределено) Экспорт

	_СчетчикПрименений = _СчетчикПрименений + 1;

	АдаптерОперации = Новый АдаптерОперацииОтказоустойчивости();
	ПодготовленнаяОперация = АдаптерОперации.Подготовить(Операция, Параметры);

	Возврат СтрШаблон("%1%2", _Префикс, ПодготовленнаяОперация.Запустить());

КонецФункции

Функция СчетчикПрименений() Экспорт
	Возврат _СчетчикПрименений;
КонецФункции
