Перем _Таймауты; // Массив
Перем _ДлительностиВыполнения; // Массив
Перем _Маркеры; // Массив

Процедура ПриСозданииОбъекта()
	_Таймауты = Новый Массив();
	_ДлительностиВыполнения = Новый Массив();
	_Маркеры = Новый Массив();
КонецПроцедуры

Процедура ПослеТаймаута(КонтекстТаймаута) Экспорт

	_Таймауты.Добавить(КонтекстТаймаута.Таймаут());
	_ДлительностиВыполнения.Добавить(КонтекстТаймаута.ДлительностьВыполнения());

КонецПроцедуры

Процедура ПослеТаймаутаСМаркером(КонтекстТаймаута, Маркер) Экспорт

	ПослеТаймаута(КонтекстТаймаута);
	_Маркеры.Добавить(Маркер);

КонецПроцедуры

Функция Таймауты() Экспорт
	Возврат _Таймауты;
КонецФункции

Функция ДлительностиВыполнения() Экспорт
	Возврат _ДлительностиВыполнения;
КонецФункции

Функция Маркеры() Экспорт
	Возврат _Маркеры;
КонецФункции
