Перем _Счетчик; // Число
Перем _ОшибокДоУспеха; // Число
Перем _Задержка; // Число
Перем _Результат; // Произвольный
Перем _КоличествоНеудачныхРезультатовДоУспеха; // Число
Перем _НеудачныйРезультат; // Произвольный

Процедура ПриСозданииОбъекта()
	_Счетчик = 0;
	_ОшибокДоУспеха = 0;
	_Задержка = 0;
	_Результат = "ok";
	_КоличествоНеудачныхРезультатовДоУспеха = 0;
	_НеудачныйРезультат = "fail";
КонецПроцедуры

Функция УстановитьОшибокДоУспеха(ОшибокДоУспеха) Экспорт
	_ОшибокДоУспеха = ОшибокДоУспеха;
	Возврат ЭтотОбъект;
КонецФункции

Функция УстановитьЗадержку(Задержка) Экспорт
	_Задержка = Задержка;
	Возврат ЭтотОбъект;
КонецФункции

Функция УстановитьРезультат(Результат) Экспорт
	_Результат = Результат;
	Возврат ЭтотОбъект;
КонецФункции

Функция УстановитьКоличествоНеудачныхРезультатовДоУспеха(КоличествоНеудачныхРезультатовДоУспеха) Экспорт
	_КоличествоНеудачныхРезультатовДоУспеха = КоличествоНеудачныхРезультатовДоУспеха;
	Возврат ЭтотОбъект;
КонецФункции

Функция УстановитьНеудачныйРезультат(НеудачныйРезультат) Экспорт
	_НеудачныйРезультат = НеудачныйРезультат;
	Возврат ЭтотОбъект;
КонецФункции

Функция Нестабильное() Экспорт

	_Счетчик = _Счетчик + 1;
	ВыполнитьЗадержку();

	Если _Счетчик <= _ОшибокДоУспеха Тогда
		ВызватьИсключение СтрШаблон("Ошибка на попытке %1", _Счетчик);
	КонецЕсли;

	Возврат _Результат;

КонецФункции

Функция НестабильныйРезультат() Экспорт

	_Счетчик = _Счетчик + 1;
	ВыполнитьЗадержку();

	Если _Счетчик <= _КоличествоНеудачныхРезультатовДоУспеха Тогда
		Возврат _НеудачныйРезультат;
	КонецЕсли;

	Возврат _Результат;

КонецФункции

Функция ВсегдаОшибка() Экспорт
	_Счетчик = _Счетчик + 1;
	ВыполнитьЗадержку();
	ВызватьИсключение "Всегда ошибка.";
КонецФункции

Функция Долгое() Экспорт
	_Счетчик = _Счетчик + 1;
	ВыполнитьЗадержку();
	Возврат _Результат;
КонецФункции

Функция Успех() Экспорт
	_Счетчик = _Счетчик + 1;
	ВыполнитьЗадержку();
	Возврат _Результат;
КонецФункции

Функция УспехСПараметрами(ПервыйПараметр, ВторойПараметр) Экспорт
	_Счетчик = _Счетчик + 1;
	ВыполнитьЗадержку();
	Возврат СтрШаблон("%1:%2", ПервыйПараметр, ВторойПараметр);
КонецФункции

Функция СчетчикВызовов() Экспорт
	Возврат _Счетчик;
КонецФункции

Процедура ВыполнитьЗадержку()
	Если _Задержка > 0 Тогда
		Приостановить(_Задержка);
	КонецЕсли;
КонецПроцедуры
