Перем _ПорогиОшибок; // Массив
Перем _КоличествоОшибокПодряд; // Массив
Перем _ДлительностиРазмыкания; // Массив
Перем _Состояния; // Массив
Перем _ЕстьДанныеОшибки; // Массив
Перем _Маркеры; // Массив
Перем _КоличествоВызововВОкне; // Массив
Перем _КоличествоОшибокВОкне; // Массив
Перем _ПроцентыОшибок; // Массив
Перем _ПричиныРазмыкания; // Массив

Процедура ПриСозданииОбъекта()

	_ПорогиОшибок = Новый Массив();
	_КоличествоОшибокПодряд = Новый Массив();
	_ДлительностиРазмыкания = Новый Массив();
	_Состояния = Новый Массив();
	_ЕстьДанныеОшибки = Новый Массив();
	_Маркеры = Новый Массив();
	_КоличествоВызововВОкне = Новый Массив();
	_КоличествоОшибокВОкне = Новый Массив();
	_ПроцентыОшибок = Новый Массив();
	_ПричиныРазмыкания = Новый Массив();

КонецПроцедуры

Процедура ПослеРазмыканияСМаркером(Контекст, Маркер) Экспорт

	ПослеРазмыкания(Контекст);
	_Маркеры.Добавить(Маркер);

КонецПроцедуры

Процедура ПослеРазмыкания(Контекст) Экспорт

	_ПорогиОшибок.Добавить(Контекст.ПорогОшибок());
	_КоличествоОшибокПодряд.Добавить(Контекст.КоличествоОшибокПодряд());
	_ДлительностиРазмыкания.Добавить(Контекст.ДлительностьРазмыкания());
	_Состояния.Добавить(Контекст.Состояние());
	_ЕстьДанныеОшибки.Добавить(Контекст.ДанныеОшибки() <> Неопределено);
	_КоличествоВызововВОкне.Добавить(Контекст.КоличествоВызововВОкне());
	_КоличествоОшибокВОкне.Добавить(Контекст.КоличествоОшибокВОкне());
	_ПроцентыОшибок.Добавить(Контекст.ПроцентОшибок());
	_ПричиныРазмыкания.Добавить(Контекст.ПричинаРазмыкания());

КонецПроцедуры

Функция ПорогиОшибок() Экспорт
	Возврат _ПорогиОшибок;
КонецФункции

Функция КоличествоОшибокПодряд() Экспорт
	Возврат _КоличествоОшибокПодряд;
КонецФункции

Функция ДлительностиРазмыкания() Экспорт
	Возврат _ДлительностиРазмыкания;
КонецФункции

Функция Состояния() Экспорт
	Возврат _Состояния;
КонецФункции

Функция ЕстьДанныеОшибки() Экспорт
	Возврат _ЕстьДанныеОшибки;
КонецФункции

Функция Маркеры() Экспорт
	Возврат _Маркеры;
КонецФункции

Функция КоличествоВызововВОкне() Экспорт
	Возврат _КоличествоВызововВОкне;
КонецФункции

Функция КоличествоОшибокВОкне() Экспорт
	Возврат _КоличествоОшибокВОкне;
КонецФункции

Функция ПроцентыОшибок() Экспорт
	Возврат _ПроцентыОшибок;
КонецФункции

Функция ПричиныРазмыкания() Экспорт
	Возврат _ПричиныРазмыкания;
КонецФункции
