Перем _БлокировкаРесурса; // БлокировкаРесурса
Перем _Начато; // Булево

Процедура ПриСозданииОбъекта()

	_БлокировкаРесурса = Новый БлокировкаРесурса(ЭтотОбъект);
	_Начато = Ложь;

КонецПроцедуры

Функция ЗапуститьСтратегию(Стратегия, Операция) Экспорт

	УстановитьНачалоВызова();

	Возврат Стратегия.Применить(Операция);

КонецФункции

Функция Начато() Экспорт

	Значение = Ложь;

	_БлокировкаРесурса.Заблокировать();

	Попытка
		Значение = _Начато;
	Исключение
		_БлокировкаРесурса.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	_БлокировкаРесурса.Разблокировать();

	Возврат Значение;

КонецФункции

Процедура УстановитьНачалоВызова()

	_БлокировкаРесурса.Заблокировать();

	Попытка
		_Начато = Истина;
	Исключение
		_БлокировкаРесурса.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	_БлокировкаРесурса.Разблокировать();

КонецПроцедуры
