Перем _ПорогиОшибок; // Массив
Перем _КоличествоОшибокПодряд; // Массив
Перем _ДлительностиРазмыкания; // Массив
Перем _Состояния; // Массив
Перем _ЕстьДанныеОшибки; // Массив
Перем _Маркеры; // Массив

Процедура ПриСозданииОбъекта()
	
	_ПорогиОшибок = Новый Массив();
	_КоличествоОшибокПодряд = Новый Массив();
	_ДлительностиРазмыкания = Новый Массив();
	_Состояния = Новый Массив();
	_ЕстьДанныеОшибки = Новый Массив();
	_Маркеры = Новый Массив();

КонецПроцедуры

Процедура ПослеРазмыканияСМаркером(Контекст, Маркер) Экспорт

	ПослеРазмыкания(Контекст);
	_Маркеры.Добавить(Маркер);

КонецПроцедуры

Процедура ПослеРазмыкания(Контекст) Экспорт

	_ПорогиОшибок.Добавить(Контекст.ПорогОшибок());
	_КоличествоОшибокПодряд.Добавить(Контекст.КоличествоОшибокПодряд());
	_ДлительностиРазмыкания.Добавить(Контекст.ДлительностьРазмыкания());
	_Состояния.Добавить(Контекст.Состояние());
	_ЕстьДанныеОшибки.Добавить(Контекст.ДанныеОшибки() <> Неопределено);

КонецПроцедуры

Функция ПорогиОшибок() Экспорт
	Возврат _ПорогиОшибок;
КонецФункции

Функция КоличествоОшибокПодряд() Экспорт
	Возврат _КоличествоОшибокПодряд;
КонецФункции

Функция ДлительностиРазмыкания() Экспорт
	Возврат _ДлительностиРазмыкания;
КонецФункции

Функция Состояния() Экспорт
	Возврат _Состояния;
КонецФункции

Функция ЕстьДанныеОшибки() Экспорт
	Возврат _ЕстьДанныеОшибки;
КонецФункции

Функция Маркеры() Экспорт
	Возврат _Маркеры;
КонецФункции
