#Использовать "..\..\.."

Перем _Стратегия; // СтратегияCircuitBreaker
Перем _ВложеннаяОперация; // Действие
Перем _ВнутреннийСбойПойман; // Булево

Процедура ПриСозданииОбъекта(Стратегия, ВложеннаяОперация)
	
	_Стратегия = Стратегия;
	_ВложеннаяОперация = ВложеннаяОперация;
	_ВнутреннийСбойПойман = Ложь;

КонецПроцедуры

Функция ВыполнитьСВложеннымЗапуском() Экспорт

	Попытка
		_Стратегия.Применить(_ВложеннаяОперация);
	Исключение
		ТекстОшибки = НРег(ОписаниеОшибки());
		Если СтрНайти(ТекстОшибки, НРег("Пробная попытка уже выполняется")) > 0 Тогда
			_ВнутреннийСбойПойман = Истина;
		Иначе
			ВызватьИсключение;
		КонецЕсли;
	КонецПопытки;

	Возврат "ok";

КонецФункции

Функция ВнутреннийСбойПойман() Экспорт
	Возврат _ВнутреннийСбойПойман;
КонецФункции
