Перем _БлокировкаРесурса; // БлокировкаРесурса
Перем _Начато; // Булево
Перем _Разрешено; // Булево
Перем _Результат; // Произвольный
Перем _СчетчикВызовов; // Число
Перем _ТаймаутОжиданияРазрешения; // Число

Процедура ПриСозданииОбъекта(Результат = "ok", ТаймаутОжиданияРазрешения = 1000)

	_БлокировкаРесурса = Новый БлокировкаРесурса(ЭтотОбъект);
	_Начато = Ложь;
	_Разрешено = Ложь;
	_Результат = Результат;
	_СчетчикВызовов = 0;
	_ТаймаутОжиданияРазрешения = ТаймаутОжиданияРазрешения;

КонецПроцедуры

Функция ВыполнитьУправляемо() Экспорт

	_БлокировкаРесурса.Заблокировать();

	Попытка
		_Начато = Истина;
		_СчетчикВызовов = _СчетчикВызовов + 1;
	Исключение
		_БлокировкаРесурса.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	_БлокировкаРесурса.Разблокировать();

	МоментНачалаОжидания = ТекущаяУниверсальнаяДатаВМиллисекундах();

	Пока Не Разрешено() Цикл
		Если ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачалаОжидания >= _ТаймаутОжиданияРазрешения Тогда
			ВызватьИсключение СтрШаблон(
				"Управляемое действие не получило разрешение за %1 мс.",
				_ТаймаутОжиданияРазрешения
			);
		КонецЕсли;

		Приостановить(10);
	КонецЦикла;

	Возврат _Результат;

КонецФункции

Функция ВыполнитьУправляемоСОшибкой() Экспорт

	ВыполнитьУправляемо();
	ВызватьИсключение "Управляемая ошибка.";

КонецФункции

Процедура Разрешить() Экспорт

	_БлокировкаРесурса.Заблокировать();

	Попытка
		_Разрешено = Истина;
	Исключение
		_БлокировкаРесурса.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	_БлокировкаРесурса.Разблокировать();

КонецПроцедуры

Функция Начато() Экспорт

	Значение = Ложь;

	_БлокировкаРесурса.Заблокировать();

	Попытка
		Значение = _Начато;
	Исключение
		_БлокировкаРесурса.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	_БлокировкаРесурса.Разблокировать();

	Возврат Значение;

КонецФункции

Функция Разрешено() Экспорт

	Значение = Ложь;

	_БлокировкаРесурса.Заблокировать();

	Попытка
		Значение = _Разрешено;
	Исключение
		_БлокировкаРесурса.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	_БлокировкаРесурса.Разблокировать();

	Возврат Значение;

КонецФункции

Функция СчетчикВызовов() Экспорт

	Значение = 0;

	_БлокировкаРесурса.Заблокировать();

	Попытка
		Значение = _СчетчикВызовов;
	Исключение
		_БлокировкаРесурса.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	_БлокировкаРесурса.Разблокировать();

	Возврат Значение;

КонецФункции
