Перем _БлокировкаРесурса; // БлокировкаРесурса
Перем _Начато; // Булево
Перем _Разрешено; // Булево
Перем _Результат; // Произвольный
Перем _СчетчикВызовов; // Число

Процедура ПриСозданииОбъекта(Результат = "ok")

	_БлокировкаРесурса = Новый БлокировкаРесурса(ЭтотОбъект);
	_Начато = Ложь;
	_Разрешено = Ложь;
	_Результат = Результат;
	_СчетчикВызовов = 0;

КонецПроцедуры

Функция ВыполнитьУправляемо() Экспорт

	_БлокировкаРесурса.Заблокировать();

	Попытка
		_Начато = Истина;
		_СчетчикВызовов = _СчетчикВызовов + 1;
	Исключение
		_БлокировкаРесурса.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	_БлокировкаРесурса.Разблокировать();

	Пока Не Разрешено() Цикл
		Приостановить(10);
	КонецЦикла;

	Возврат _Результат;

КонецФункции

Процедура Разрешить() Экспорт

	_БлокировкаРесурса.Заблокировать();

	Попытка
		_Разрешено = Истина;
	Исключение
		_БлокировкаРесурса.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	_БлокировкаРесурса.Разблокировать();

КонецПроцедуры

Функция Начато() Экспорт

	Значение = Ложь;

	_БлокировкаРесурса.Заблокировать();

	Попытка
		Значение = _Начато;
	Исключение
		_БлокировкаРесурса.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	_БлокировкаРесурса.Разблокировать();

	Возврат Значение;

КонецФункции

Функция Разрешено() Экспорт

	Значение = Ложь;

	_БлокировкаРесурса.Заблокировать();

	Попытка
		Значение = _Разрешено;
	Исключение
		_БлокировкаРесурса.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	_БлокировкаРесурса.Разблокировать();

	Возврат Значение;

КонецФункции

Функция СчетчикВызовов() Экспорт

	Значение = 0;

	_БлокировкаРесурса.Заблокировать();

	Попытка
		Значение = _СчетчикВызовов;
	Исключение
		_БлокировкаРесурса.Разблокировать();
		ВызватьИсключение;
	КонецПопытки;

	_БлокировкаРесурса.Разблокировать();

	Возврат Значение;

КонецФункции
