Перем _ЛимитыПараллелизма; // Массив
Перем _ЛимитыОчереди; // Массив
Перем _КоличествоВыполняющихся; // Массив
Перем _КоличествоОжидающих; // Массив

Процедура ПриСозданииОбъекта()
	_ЛимитыПараллелизма = Новый Массив();
	_ЛимитыОчереди = Новый Массив();
	_КоличествоВыполняющихся = Новый Массив();
	_КоличествоОжидающих = Новый Массив();
КонецПроцедуры

Процедура ПослеПереполнения(КонтекстПереполненияПараллелизма) Экспорт

	_ЛимитыПараллелизма.Добавить(КонтекстПереполненияПараллелизма.ЛимитПараллелизма());
	_ЛимитыОчереди.Добавить(КонтекстПереполненияПараллелизма.ЛимитОчереди());
	_КоличествоВыполняющихся.Добавить(КонтекстПереполненияПараллелизма.КоличествоВыполняющихся());
	_КоличествоОжидающих.Добавить(КонтекстПереполненияПараллелизма.КоличествоОжидающих());

КонецПроцедуры

Функция ЛимитыПараллелизма() Экспорт
	Возврат _ЛимитыПараллелизма;
КонецФункции

Функция ЛимитыОчереди() Экспорт
	Возврат _ЛимитыОчереди;
КонецФункции

Функция КоличествоВыполняющихся() Экспорт
	Возврат _КоличествоВыполняющихся;
КонецФункции

Функция КоличествоОжидающих() Экспорт
	Возврат _КоличествоОжидающих;
КонецФункции
