Перем _Стратегия; // СтратегияОграниченияПараллелизма
Перем _ВложеннаяОперация; // Действие
Перем _ТекстВнутреннейОшибки; // Строка, Неопределено

Процедура ПриСозданииОбъекта(Стратегия, ВложеннаяОперация)

	_Стратегия = Стратегия;
	_ВложеннаяОперация = ВложеннаяОперация;
	_ТекстВнутреннейОшибки = Неопределено;

КонецПроцедуры

Функция ВыполнитьСВложеннымЗапуском() Экспорт

	Попытка
		_Стратегия.Применить(_ВложеннаяОперация);
	Исключение
		_ТекстВнутреннейОшибки = ОписаниеОшибки();
	КонецПопытки;

	Возврат "ok";

КонецФункции

Функция ТекстВнутреннейОшибки() Экспорт
	Возврат _ТекстВнутреннейОшибки;
КонецФункции
