
Функция ПараметрыИсполнения(Операция, ПараметрыОперации = Неопределено) Экспорт

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Операция);

	Если ПараметрыОперации <> Неопределено Тогда
		ПараметрыМетода.Добавить(ПараметрыОперации);
	КонецЕсли;

	Возврат ПараметрыМетода;

КонецФункции

Функция СоздатьПайплайнОтказоустойчивости(Стратегии = Неопределено) Экспорт

	Возврат Новый ПайплайнОтказоустойчивости(Стратегии);

КонецФункции

Функция СоздатьСтратегиюОграниченияПараллелизма(ЛимитПараллелизма, ЛимитОчереди = 0) Экспорт

	Возврат Новый СтратегияОграниченияПараллелизма(ЛимитПараллелизма, ЛимитОчереди);

КонецФункции

Функция ЗапуститьПараллельныеВызовыСтратегии(Стратегия, Операция, КоличествоЗадач) Экспорт

	Задачи = Новый Массив();

	Для Счетчик = 1 По КоличествоЗадач Цикл
		Задачи.Добавить(ФоновыеЗадания.Выполнить(Стратегия, "Применить", ПомощникТестирования.ПараметрыИсполнения(Операция)));
	КонецЦикла;

	Возврат Задачи;

КонецФункции
