#Использовать ".."
#Использовать "."

// Пример показывает отправку уведомлений к внешнему сервису с жестким лимитом частоты.

// Подготовка
Сервис = Новый НестабильныйСервис();
Операция = Новый Действие(Сервис, "ПолучитьДанные");

// Настройка
// Например, внешний сервис принимает только одно уведомление за 500 мс.
// При превышении лимита обработчик выведет сообщение вида:
// Лимит исчерпан, повторите через 4xx мс.
Стратегия = Новый СтратегияОграниченияВызовов()
	.УстановитьЛимитВызовов(1)
	.УстановитьИнтервалЛимита(500)
	.УстановитьОбработчикПревышенияЛимита(
		"(КонтекстПревышенияЛимита) -> Сообщить(
		|	СтрШаблон(
		|		""Лимит исчерпан, повторите через %1 мс."",
		|		КонтекстПревышенияЛимита.ОсталосьОжидать()
		|	)
		|)"
	);

// Запуск
// Выведет: Уведомление 1 отправлено: Данные получены на попытке 1
Сообщить("Уведомление 1 отправлено: " + Строка(Стратегия.Применить(Операция)));

Попытка
	Стратегия.Применить(Операция);
Исключение
	// Выведет сообщение вида: Уведомление 2 отложено: Превышен лимит вызовов...
	Сообщить("Уведомление 2 отложено: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
КонецПопытки;

Приостановить(600);

// Выведет: Уведомление 2 отправлено позже: Данные получены на попытке 2
Сообщить("Уведомление 2 отправлено позже: " + Строка(Стратегия.Применить(Операция)));
