Перем _Длительность; // Число
Перем _КвантОжидания; // Число
Перем _СигналПрерыванияОперации;

// Создает сервис с длительной операцией, которую можно завершить кооперативно.
//
// Параметры:
//   Длительность - Число - Общая длительность операции в миллисекундах.
Процедура ПриСозданииОбъекта(Длительность = 500)

	_Длительность = Длительность;
	_КвантОжидания = 50;

КонецПроцедуры

// Устанавливает сигнал, который сервис будет периодически проверять во время работы.
//
// Параметры:
//   СигналПрерыванияОперации - СигналПрерыванияОперации - Общий сигнал прерывания операции.
Процедура УстановитьСигналПрерывания(СигналПрерыванияОперации) Экспорт

	_СигналПрерыванияОперации = СигналПрерыванияОперации;

КонецПроцедуры

// Возвращает данные после длительной работы или прерывается по установленному сигналу.
//
// Возвращаемое значение:
//   Строка - Сообщение с длительностью выполненной операции.
Функция ПолучитьДанные() Экспорт

	ОсталосьОжидать = _Длительность;

	Пока ОсталосьОжидать > 0 Цикл

		Если _СигналПрерыванияОперации <> Неопределено Тогда
			// Генерирует исключение, если было запрошено прерывание.
			_СигналПрерыванияОперации.ПроверитьПрерывание();
		КонецЕсли;

		// Полезная нагрузка
		ТекущийКвант = Мин(_КвантОжидания, ОсталосьОжидать);
		Приостановить(ТекущийКвант);
		ОсталосьОжидать = ОсталосьОжидать - ТекущийКвант;

	КонецЦикла;

	Возврат СтрШаблон("Данные получены за %1 мс", _Длительность);

КонецФункции
